pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Copyright 2020 Phil Schatzmann
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD

#include "BluetoothA2DPSink.h"

// to support static callback functions
BluetoothA2DPSink *actual_bluetooth_a2dp_sink;

extern "C" void ccall_i2s_task_handler(void *arg) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->i2s_task_handler(arg);
}

extern "C" void ccall_audio_data_callback(const uint8_t *data, uint32_t len) {
  // ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->audio_data_callback(data, len);
}

extern "C" void ccall_av_hdl_avrc_evt(uint16_t event, void *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink) {
    actual_bluetooth_a2dp_sink->av_hdl_avrc_evt(event, param);
  }
}

extern "C" void ccall_av_hdl_a2d_evt(uint16_t event, void *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink) {
    actual_bluetooth_a2dp_sink->av_hdl_a2d_evt(event, param);
  }
}

/**
 * Constructor
 */
BluetoothA2DPSink::BluetoothA2DPSink() {
  actual_bluetooth_a2dp_sink = this;
  actual_bluetooth_a2dp_common = this;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  s_avrc_peer_rn_cap.bits = 0;
  _lock_init(&s_volume_lock);
#endif
}

BluetoothA2DPSink::~BluetoothA2DPSink() {
  if (app_task_queue != nullptr) {
    end();
  }
}

void BluetoothA2DPSink::end(bool release_memory) {
  ESP_LOGI(BT_AV_TAG, "%s", __func__);
  // reconnect should not work after end
  is_autoreconnect_allowed = false;

  BluetoothA2DPCommon::end(release_memory);

  if (is_output) {
    out->end();
  }
}

void BluetoothA2DPSink::set_stream_reader(void (*callBack)(const uint8_t *,
                                                           uint32_t),
                                          bool is_i2s) {
  this->stream_reader = callBack;
  this->is_output = is_i2s;
}

void BluetoothA2DPSink::set_raw_stream_reader(void (*callBack)(const uint8_t *,
                                                               uint32_t)) {
  this->raw_stream_reader = callBack;
}

void BluetoothA2DPSink::set_on_data_received(void (*callBack)()) {
  this->data_received = callBack;
}

// kept for backwards compatibility
void BluetoothA2DPSink::set_on_volumechange(void (*callBack)(int)) {
  this->bt_volumechange = callBack;
}

void BluetoothA2DPSink::set_avrc_rn_volumechange(void (*callBack)(int)) {
  this->bt_volumechange = callBack;
}

void BluetoothA2DPSink::set_avrc_rn_volumechange_completed(
    void (*callBack)(int)) {
  this->avrc_rn_volchg_complete_callback = callBack;
}

void BluetoothA2DPSink::start(const char *name, bool auto_reconnect) {
  set_auto_reconnect(auto_reconnect, AUTOCONNECT_TRY_NUM);
  start(name);
}
/**
 * Main function to start the Bluetooth Processing
 */
void BluetoothA2DPSink::start(const char *name) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  log_free_heap();

  is_autoreconnect_allowed = (reconnect_status == AutoReconnect);  

  if (is_start_disabled) {
    ESP_LOGE(BT_AV_TAG, "re-start not supported after end(true)");
    return;
  }

  // store parameters
  if (name) {
    this->bt_name = name;
  }
  ESP_LOGI(BT_AV_TAG, "Device name will be set to '%s'", this->bt_name);


  if (is_autoreconnect_allowed) {
    // Initialize NVS
    init_nvs();

    // reconnect management
    // grab last connnectiom, even if we dont use it now for auto reconnect
    get_last_connection();

    memcpy(peer_bd_addr, last_connection, ESP_BD_ADDR_LEN);

    // trigger timeout
    delay_ms(reconnect_delay);
  }

  // setup i2s
  init_i2s();

  // setup bluetooth
  init_bluetooth();

  // create application task
  app_task_start_up();

  // Bluetooth device name, connection mode and profile set up
  app_work_dispatch(ccall_av_hdl_stack_evt, BT_APP_EVT_STACK_UP, nullptr, 0);

  // handle security pin
  if (is_pin_code_active) {
    // Set default parameters for Secure Simple Pairing
    esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
    esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IO;
    esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
    // invokes callbacks
    esp_bt_pin_type_t pin_type = ESP_BT_PIN_TYPE_VARIABLE;
    esp_bt_pin_code_t pin_code;
    esp_bt_gap_set_pin(pin_type, 0, pin_code);

  } else {
    // Set default parameters for Secure Simple Pairing
    esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
    esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_NONE;
    esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
    // no callbacks
    esp_bt_pin_type_t pin_type = ESP_BT_PIN_TYPE_FIXED;
    esp_bt_pin_code_t pin_code;
    esp_bt_gap_set_pin(pin_type, 0, pin_code);
  }

  ESP_LOGI(BT_AV_TAG, "IDF Version %d.%d", ESP_IDF_VERSION_MAJOR,
           ESP_IDF_VERSION_MINOR);
  log_free_heap();
}

void BluetoothA2DPSink::init_i2s() {
  ESP_LOGI(BT_AV_TAG, "init_i2s");
  if (is_output) {
    out->begin();
    is_i2s_active = true;
  }
}

esp_a2d_mct_t BluetoothA2DPSink::get_audio_type() { return audio_type; }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
const char *BluetoothA2DPSink::get_connected_source_name() {
  if (is_connected()) {
    return (remote_name);
  } else {
    return ("unknown");
  }
}
#endif

int BluetoothA2DPSink::init_bluetooth() {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (!bt_start()) {
    ESP_LOGE(BT_AV_TAG, "Failed to initialize controller");
    return false;
  }
  ESP_LOGI(BT_AV_TAG, "controller initialized");

