pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
  esp_bluedroid_status_t bt_stack_status = esp_bluedroid_get_status();

  if (bt_stack_status == ESP_BLUEDROID_STATUS_UNINITIALIZED) {
    if (bluedroid_init() != ESP_OK) {
      ESP_LOGE(BT_AV_TAG, "Failed to initialize bluedroid");
      return false;
    }
    ESP_LOGI(BT_AV_TAG, "bluedroid initialized");
  }

  while (bt_stack_status != ESP_BLUEDROID_STATUS_ENABLED) {
    if (esp_bluedroid_enable() != ESP_OK) {
      ESP_LOGE(BT_AV_TAG, "Failed to enable bluedroid");
      delay_ms(100);
      // return false;
    } else {
      ESP_LOGI(BT_AV_TAG, "bluedroid enabled");
    }
    bt_stack_status = esp_bluedroid_get_status();
  }

  if (esp_bt_gap_register_callback(ccall_app_gap_callback) != ESP_OK) {
    ESP_LOGE(BT_AV_TAG, "gap register failed");
    return false;
  }

#if A2DP_SPP_SUPPORT
  if (spp_active) {
    if ((esp_spp_init(esp_spp_mode)) != ESP_OK) {
      ESP_LOGE(BT_AV_TAG, "esp_spp_init failed");
      return false;
    }
  }
#endif

  return true;
}

bool BluetoothA2DPSink::app_work_dispatch(app_callback_t p_cback,
                                          uint16_t event, void *p_params,
                                          int param_len) {
  ESP_LOGD(BT_APP_TAG, "%s event 0x%x, param len %d", __func__, event,
           param_len);

  bt_app_msg_t msg;
  memset(&msg, 0, sizeof(bt_app_msg_t));

  msg.sig = APP_SIG_WORK_DISPATCH;
  msg.event = event;
  msg.cb = p_cback;

  if (param_len == 0) {
    return app_send_msg(&msg);
  } else if (p_params && param_len > 0) {
    if ((msg.param = malloc(param_len)) != nullptr) {
      memcpy(msg.param, p_params, param_len);
      return app_send_msg(&msg);
    }
  }

  return false;
}


void BluetoothA2DPSink::app_alloc_meta_buffer(esp_avrc_ct_cb_param_t *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  esp_avrc_ct_cb_param_t *rc = (esp_avrc_ct_cb_param_t *)(param);
  uint8_t *attr_text = (uint8_t *)malloc(rc->meta_rsp.attr_length + 1);
  memcpy(attr_text, rc->meta_rsp.attr_text, rc->meta_rsp.attr_length);
  attr_text[rc->meta_rsp.attr_length] = 0;

  rc->meta_rsp.attr_text = attr_text;
}

void BluetoothA2DPSink::app_gap_callback(esp_bt_gap_cb_event_t event,
                                         esp_bt_gap_cb_param_t *param) {
  switch (event) {
    case ESP_BT_GAP_AUTH_CMPL_EVT: {
      if (param->auth_cmpl.stat == ESP_BT_STATUS_SUCCESS) {
        ESP_LOGI(BT_AV_TAG, "authentication success: %s",
                 param->auth_cmpl.device_name);
        //  esp_log_buffer_hex(BT_AV_TAG, param->auth_cmpl.bda,
        //  ESP_BD_ADDR_LEN);

      } else {
        ESP_LOGE(BT_AV_TAG, "authentication failed, status:%d",
                 param->auth_cmpl.stat);
        // reset pin_code data to "undefined" after authentication failure
        // just like when in disconnected state
        pin_code_int = 0;
        pin_code_request = Undefined;
      }
      break;
    }

    case ESP_BT_GAP_PIN_REQ_EVT: {
      memcpy(peer_bd_addr, param->pin_req.bda, ESP_BD_ADDR_LEN);
      ESP_LOGI(BT_AV_TAG, "partner address: %s", to_str(peer_bd_addr));
    } break;

    case ESP_BT_GAP_CFM_REQ_EVT: {
      memcpy(peer_bd_addr, param->cfm_req.bda, ESP_BD_ADDR_LEN);
      ESP_LOGI(BT_AV_TAG, "partner address: %s", to_str(peer_bd_addr));

      ESP_LOGI(BT_AV_TAG,
               "ESP_BT_GAP_CFM_REQ_EVT Please confirm the passkey: %d",
               param->cfm_req.num_val);
      pin_code_int = param->key_notif.passkey;
      pin_code_request = Confirm;
    } break;

    case ESP_BT_GAP_KEY_NOTIF_EVT: {
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_KEY_NOTIF_EVT passkey:%d",
               param->key_notif.passkey);
      pin_code_int = param->key_notif.passkey;
      pin_code_request = Reply;
    } break;

    case ESP_BT_GAP_KEY_REQ_EVT: {
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_KEY_REQ_EVT Please enter passkey!");
      pin_code_request = Reply;
    } break;

    case ESP_BT_GAP_READ_RSSI_DELTA_EVT: {
      last_rssi_delta = param->read_rssi_delta;
      if (rssi_callbak != nullptr) {
        rssi_callbak(last_rssi_delta);
      }
      break;
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    case ESP_BT_GAP_READ_REMOTE_NAME_EVT: {
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_READ_REMOTE_NAME_EVT stat:%d",
               param->read_rmt_name.stat);
      if (param->read_rmt_name.stat == ESP_BT_STATUS_SUCCESS) {
        ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_READ_REMOTE_NAME_EVT remote name:%s",
                 param->read_rmt_name.rmt_name);
        memcpy(remote_name, param->read_rmt_name.rmt_name,
               ESP_BT_GAP_MAX_BDNAME_LEN);
      }
    } break;

    case ESP_BT_GAP_MODE_CHG_EVT: {
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_MODE_CHG_EVT");
      log_free_heap();
    } break;
#endif

    default: {
      ESP_LOGI(BT_AV_TAG, "event: %d", event);
      break;
    }
  }
  return;
}

void BluetoothA2DPSink::app_rc_ct_callback(esp_avrc_ct_cb_event_t event,
                                           esp_avrc_ct_cb_param_t *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);

  switch (event) {
    case ESP_AVRC_CT_METADATA_RSP_EVT:
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_CT_METADATA_RSP_EVT", __func__);
      app_alloc_meta_buffer(param);
      app_work_dispatch(ccall_av_hdl_avrc_evt, event, param,
                        sizeof(esp_avrc_ct_cb_param_t));
      break;
    case ESP_AVRC_CT_CONNECTION_STATE_EVT:
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_CT_CONNECTION_STATE_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_avrc_evt, event, param,
                        sizeof(esp_avrc_ct_cb_param_t));
      break;
    case ESP_AVRC_CT_PASSTHROUGH_RSP_EVT:
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_CT_PASSTHROUGH_RSP_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_avrc_evt, event, param,
                        sizeof(esp_avrc_ct_cb_param_t));
      break;
    case ESP_AVRC_CT_CHANGE_NOTIFY_EVT:
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_CT_CHANGE_NOTIFY_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_avrc_evt, event, param,
                        sizeof(esp_avrc_ct_cb_param_t));
      break;
    case ESP_AVRC_CT_REMOTE_FEATURES_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_CT_REMOTE_FEATURES_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_avrc_evt, event, param,
                        sizeof(esp_avrc_ct_cb_param_t));
      break;
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

    case ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT",
               __func__);
      app_work_dispatch(ccall_av_hdl_avrc_evt, event, param,
                        sizeof(esp_avrc_ct_cb_param_t));
      break;
    }

#endif

    default:
      ESP_LOGE(BT_AV_TAG, "Invalid AVRC event: %d", event);
      break;
  }
}

void BluetoothA2DPSink::av_hdl_a2d_evt(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = nullptr;
  switch (event) {
    case ESP_A2D_CONNECTION_STATE_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_CONNECTION_STATE_EVT", __func__);
      handle_connection_state(event, p_param);
    } break;

