pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
    case ESP_A2D_AUDIO_STATE_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_AUDIO_STATE_EVT", __func__);
      handle_audio_state(event, p_param);

    } break;
    case ESP_A2D_AUDIO_CFG_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_AUDIO_CFG_EVT", __func__);
      handle_audio_cfg(event, p_param);

    } break;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

    case ESP_A2D_PROF_STATE_EVT: {
      a2d = (esp_a2d_cb_param_t *)(p_param);
      if (ESP_A2D_INIT_SUCCESS == a2d->a2d_prof_stat.init_state) {
        ESP_LOGI(BT_AV_TAG, "A2DP PROF STATE: Init Compl\n");
      } else {
        ESP_LOGI(BT_AV_TAG, "A2DP PROF STATE: Deinit Compl\n");
      }
    } break;

#endif

    default:
      ESP_LOGE(BT_AV_TAG, "%s unhandled evt %d", __func__, event);
      break;
  }
}

void BluetoothA2DPSink::handle_audio_cfg(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = (esp_a2d_cb_param_t *)(p_param);
  audio_type = a2d->audio_cfg.mcc.type;
  ESP_LOGI(BT_AV_TAG, "a2dp audio_cfg_cb , codec type %d",
           a2d->audio_cfg.mcc.type);

  // determine sample rate
  m_sample_rate = 16000;
  char oct0 = a2d->audio_cfg.mcc.cie.sbc[0];
  if (oct0 & (0x01 << 6)) {
    m_sample_rate = 32000;
  } else if (oct0 & (0x01 << 5)) {
    m_sample_rate = 44100;
  } else if (oct0 & (0x01 << 4)) {
    m_sample_rate = 48000;
  }
  ESP_LOGI(BT_AV_TAG, "a2dp audio_cfg_cb , sample_rate %d", m_sample_rate);
  if (sample_rate_callback != nullptr) {
    sample_rate_callback(m_sample_rate);
  }

  // for now only SBC stream is supported
  if (a2d->audio_cfg.mcc.type == ESP_A2D_MCT_SBC) {
    ESP_LOGI(BT_AV_TAG, "configure audio player %x-%x-%x-%x\n",
             a2d->audio_cfg.mcc.cie.sbc[0], a2d->audio_cfg.mcc.cie.sbc[1],
             a2d->audio_cfg.mcc.cie.sbc[2], a2d->audio_cfg.mcc.cie.sbc[3]);

    out->set_sample_rate(m_sample_rate);
  }
}

void BluetoothA2DPSink::handle_avrc_connection_state(bool connected) {
  ESP_LOGD(BT_AV_TAG, "%s state %d", __func__, connected);
  avrc_connection_state = connected;
  if (avrc_connection_state_callback != nullptr) {
    avrc_connection_state_callback(connected);
  }
}

void BluetoothA2DPSink::handle_audio_state(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = (esp_a2d_cb_param_t *)(p_param);
  ESP_LOGI(BT_AV_TAG, "A2DP audio state: %s", to_str(a2d->audio_stat.state));

  // callback on state change
  audio_state = a2d->audio_stat.state;
  if (audio_state_callback != nullptr) {
    audio_state_callback(a2d->audio_stat.state, audio_state_obj);
  }

  if (ESP_A2D_AUDIO_STATE_STARTED == a2d->audio_stat.state) {
    set_i2s_active(true);
  } else if (ESP_A2D_AUDIO_STATE_REMOTE_SUSPEND == a2d->audio_stat.state ||
             ESP_A2D_AUDIO_STATE_STOPPED == a2d->audio_stat.state) {
    set_i2s_active(false);
  }

  if (audio_state_callback_post != nullptr) {
    audio_state_callback_post(a2d->audio_stat.state, audio_state_obj_post);
  }
}

void BluetoothA2DPSink::set_i2s_active(bool active) {
  ESP_LOGI(BT_AV_TAG, "%s %d", __func__, active);
  if (active) m_pkt_cnt = 0;
  if (is_output) {
    if (is_i2s_active != active) {
      // mark deactive before deactivating i2s
      if (!active) is_i2s_active = false;
      out->set_output_active(active);
      // active flag after i2s is active
      if (active) is_i2s_active = true;
    }
  } else {
    // just update the actual status
    is_i2s_active = active;
  }
}

void BluetoothA2DPSink::handle_connection_state(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = (esp_a2d_cb_param_t *)(p_param);

  // determine remote BDA
  memcpy(peer_bd_addr, a2d->conn_stat.remote_bda, ESP_BD_ADDR_LEN);
  ESP_LOGI(BT_AV_TAG, "partner address: %s", to_str(peer_bd_addr));

  ESP_LOGI(BT_AV_TAG, "A2DP connection state: %s, [%s]",
           to_str(a2d->conn_stat.state), to_str(a2d->conn_stat.remote_bda));
  switch (a2d->conn_stat.state) {
    case ESP_A2D_CONNECTION_STATE_DISCONNECTING:
      ESP_LOGI(BT_AV_TAG, "ESP_A2D_CONNECTION_STATE_DISCONNECTING");
      if (a2d->conn_stat.disc_rsn == ESP_A2D_DISC_RSN_NORMAL) {
        is_autoreconnect_allowed = false;
      }
      break;

    case ESP_A2D_CONNECTION_STATE_DISCONNECTED:
      ESP_LOGI(BT_AV_TAG, "ESP_A2D_CONNECTION_STATE_DISCONNECTED");
      if (a2d->conn_stat.disc_rsn == ESP_A2D_DISC_RSN_NORMAL) {
        is_autoreconnect_allowed = false;
      }

      // reset pin code
      pin_code_int = 0;
      pin_code_request = Undefined;

      // call callback
      if (bt_dis_connected != nullptr) {
        (*bt_dis_connected)();
      }

      bt_i2s_task_shut_down();

      // RECONNECTION MGMT
      // do not auto reconnect when disconnect was requested from device
      if (is_autoreconnect_allowed) {
        if (is_reconnect(a2d->conn_stat.disc_rsn)) {
          if (connection_rety_count < try_reconnect_max_count) {
            ESP_LOGI(BT_AV_TAG, "Connection try number: %d",
                     connection_rety_count);
            // make sure that any open connection is timing out on the target
            memcpy(peer_bd_addr, last_connection, ESP_BD_ADDR_LEN);
            reconnect();
            // when we lost the connection we do allow any others to connect
            // after 2 trials
            if (connection_rety_count == 2) set_scan_mode_connectable(true);

          } else {
            ESP_LOGI(BT_AV_TAG, "Reconect retry limit reached");
            if (has_last_connection() &&
                a2d->conn_stat.disc_rsn == ESP_A2D_DISC_RSN_NORMAL) {
              clean_last_connection();
            }
            set_scan_mode_connectable(true);
          }
        } else {
          set_scan_mode_connectable(true);
        }
      } else {
        set_scan_mode_connectable(true);
      }
      break;

    case ESP_A2D_CONNECTION_STATE_CONNECTING:
      ESP_LOGI(BT_AV_TAG, "ESP_A2D_CONNECTION_STATE_CONNECTING");
      connection_rety_count++;
      break;

    case ESP_A2D_CONNECTION_STATE_CONNECTED:
      ESP_LOGI(BT_AV_TAG, "ESP_A2D_CONNECTION_STATE_CONNECTED");

      // stop reconnect retries in event loop
      if (reconnect_status == IsReconnecting) {
        reconnect_status = AutoReconnect;
      }

