pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
      // checks if the address is valid
      bool is_valid = true;
      if (address_validator != nullptr) {
        uint8_t *bda = a2d->conn_stat.remote_bda;
        if (!address_validator(bda)) {
          ESP_LOGI(BT_AV_TAG, "esp_a2d_sink_disconnect: %s", (char *)bda);
          esp_a2d_sink_disconnect(bda);
          is_valid = false;
        }
      }

      if (is_valid) {
        if (bt_connected != nullptr) {
          (*bt_connected)();
        }

        set_scan_mode_connectable(false);
        connection_rety_count = 0;

        bt_i2s_task_start_up();

        // record current connection
        if (reconnect_status == AutoReconnect && is_valid) {
          set_last_connection(a2d->conn_stat.remote_bda);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
        // ask for the remote name
        esp_err_t esp_err =
            esp_bt_gap_read_remote_name(a2d->conn_stat.remote_bda);
        if (esp_err != ESP_OK) {
          ESP_LOGE(BT_AV_TAG, "esp_bt_gap_read_remote_name");
        }
#endif

        // Get RSSI
        if (rssi_active) {
          esp_bt_gap_read_rssi_delta(a2d->conn_stat.remote_bda);
        }
      }
      break;
  }

  // callback
  connection_state = a2d->conn_stat.state;
  if (connection_state_callback != nullptr) {
    connection_state_callback(connection_state, connection_state_obj);
  }
}

void BluetoothA2DPSink::av_new_track() {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  // Register notifications and request metadata
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  esp_avrc_ct_send_metadata_cmd(APP_RC_CT_TL_GET_META_DATA,
                                avrc_metadata_flags);
  if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST,
                                         &s_avrc_peer_rn_cap,
                                         ESP_AVRC_RN_TRACK_CHANGE)) {
    esp_avrc_ct_send_register_notification_cmd(APP_RC_CT_TL_RN_TRACK_CHANGE,
                                               ESP_AVRC_RN_TRACK_CHANGE, 0);
  }
#endif
}

void BluetoothA2DPSink::av_playback_changed() {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST,
                                         &s_avrc_peer_rn_cap,
                                         ESP_AVRC_RN_PLAY_STATUS_CHANGE)) {
    esp_avrc_ct_send_register_notification_cmd(
        APP_RC_CT_TL_RN_PLAYBACK_CHANGE, ESP_AVRC_RN_PLAY_STATUS_CHANGE, 0);
  }
#endif
}

void BluetoothA2DPSink::av_play_pos_changed(void) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST,
                                         &s_avrc_peer_rn_cap,
                                         ESP_AVRC_RN_PLAY_POS_CHANGED)) {
    esp_avrc_ct_send_register_notification_cmd(APP_RC_CT_TL_RN_PLAY_POS_CHANGE,
                                               ESP_AVRC_RN_PLAY_POS_CHANGED,
                                               notif_interval_s);
  }
#endif
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
void BluetoothA2DPSink::av_notify_evt_handler(
    uint8_t event_id, esp_avrc_rn_param_t *event_parameter)
#else
void BluetoothA2DPSink::av_notify_evt_handler(uint8_t event_id,
                                              uint32_t event_parameter)
#endif
{
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  switch (event_id) {
    case ESP_AVRC_RN_TRACK_CHANGE:
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_RN_TRACK_CHANGE %d", __func__, event_id);
      av_new_track();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      // call avrc track change notification callback if available
      if (avrc_rn_track_change_callback != nullptr) {
        avrc_rn_track_change_callback(event_parameter->elm_id);
      }
#endif
      break;
    case ESP_AVRC_RN_PLAY_STATUS_CHANGE:
      ESP_LOGD(BT_AV_TAG, "%s ESP_AVRC_RN_PLAY_STATUS_CHANGE %d, to %d",
               __func__, event_id, event_parameter->playback);
      av_playback_changed();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      // call avrc play status notification callback if available
      if (avrc_rn_playstatus_callback != nullptr) {
        avrc_rn_playstatus_callback(event_parameter->playback);
      }
#endif
      break;

    case ESP_AVRC_RN_PLAY_POS_CHANGED:
      ESP_LOGI(BT_AV_TAG, "Play position changed: %d-ms",
               event_parameter->play_pos);
      av_play_pos_changed();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      // call avrc play status notification callback if available
      if (avrc_rn_play_pos_callback != nullptr) {
        avrc_rn_play_pos_callback(event_parameter->play_pos);
      }
#endif
      break;

    default:
      ESP_LOGE(BT_AV_TAG, "%s unhandled evt %d", __func__, event_id);
      break;
  }
}

void BluetoothA2DPSink::av_hdl_avrc_evt(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_avrc_ct_cb_param_t *rc = (esp_avrc_ct_cb_param_t *)(p_param);
  switch (event) {
    case ESP_AVRC_CT_CONNECTION_STATE_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC conn_state evt: state %d, [%s]",
               rc->conn_stat.connected, to_str(rc->conn_stat.remote_bda));
      avrc_connection_state = rc->conn_stat.connected;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      if (avrc_connection_state) {
        // get remote supported event_ids of peer AVRCP Target
        esp_avrc_ct_send_get_rn_capabilities_cmd(APP_RC_CT_TL_GET_CAPS);
      } else {
        // clear peer notification capability record
        s_avrc_peer_rn_cap.bits = 0;
        handle_avrc_connection_state(avrc_connection_state);
      }
#else
      if (avrc_connection_state) {
        av_new_track();
      }
      handle_avrc_connection_state(avrc_connection_state);
#endif
      break;
    }
    case ESP_AVRC_CT_PASSTHROUGH_RSP_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC passthrough rsp: key_code 0x%x, key_state %d",
               rc->psth_rsp.key_code, rc->psth_rsp.key_state);
      break;
    }
    case ESP_AVRC_CT_METADATA_RSP_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC metadata rsp: attribute id 0x%x, %s",
               rc->meta_rsp.attr_id, rc->meta_rsp.attr_text);
      // call metadata callback if available
      if (avrc_metadata_callback != nullptr) {
        avrc_metadata_callback(rc->meta_rsp.attr_id, rc->meta_rsp.attr_text);
      }

      free(rc->meta_rsp.attr_text);
      break;
    }
    case ESP_AVRC_CT_CHANGE_NOTIFY_EVT: {
      // ESP_LOGI(BT_AV_TAG, "AVRC event notification: %d, param: %d",
      // (int)rc->change_ntf.event_id, (int)rc->change_ntf.event_parameter);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      av_notify_evt_handler(rc->change_ntf.event_id,
                            &rc->change_ntf.event_parameter);
#else
      av_notify_evt_handler(rc->change_ntf.event_id,
                            rc->change_ntf.event_parameter);
#endif
      break;
    }
    case ESP_AVRC_CT_REMOTE_FEATURES_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC remote features %x", rc->rmt_feats.feat_mask);
      break;
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

    case ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT: {
      ESP_LOGI(BT_AV_TAG, "remote rn_cap: count %d, bitmask 0x%x",
               rc->get_rn_caps_rsp.cap_count, rc->get_rn_caps_rsp.evt_set.bits);
      s_avrc_peer_rn_cap.bits = rc->get_rn_caps_rsp.evt_set.bits;
      av_new_track();
      av_playback_changed();
      av_play_pos_changed();

      // now we ready to callback
      handle_avrc_connection_state(avrc_connection_state);

      break;
    }

#endif

    default:
      ESP_LOGE(BT_AV_TAG, "%s unhandled evt %d", __func__, event);
      break;
  }
}

void BluetoothA2DPSink::av_hdl_stack_evt(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_err_t result;

