pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
  switch (event) {
    case BT_APP_EVT_STACK_UP: {
      ESP_LOGD(BT_AV_TAG, "%s av_hdl_stack_evt %s", __func__,
               "BT_APP_EVT_STACK_UP");
      /* set up device name */
      esp_bt_gap_set_device_name(bt_name);

      // initialize AVRCP controller
      result = esp_avrc_ct_init();
      if (result == ESP_OK) {
        result = esp_avrc_ct_register_callback(ccall_app_rc_ct_callback);
        if (result == ESP_OK) {
          ESP_LOGD(BT_AV_TAG, "AVRCP controller initialized!");
        } else {
          ESP_LOGE(BT_AV_TAG, "esp_avrc_ct_register_callback: %d", result);
        }
      } else {
        ESP_LOGE(BT_AV_TAG, "esp_avrc_ct_init: %d", result);
      }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

      /* initialize AVRCP target */
      if (esp_avrc_tg_init() == ESP_OK) {
        esp_avrc_tg_register_callback(ccall_app_rc_tg_callback);
        // add request to ESP_AVRC_RN_VOLUME_CHANGE
        esp_avrc_rn_evt_cap_mask_t evt_set = {0};
        for (auto event : avrc_rn_events) {
          esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_SET, &evt_set,
                                             event);
        }
        if (esp_avrc_tg_set_rn_evt_cap(&evt_set) != ESP_OK) {
          ESP_LOGE(BT_AV_TAG, "esp_avrc_tg_set_rn_evt_cap failed");
        }
      } else {
        ESP_LOGE(BT_AV_TAG, "esp_avrc_tg_init failed");
      }

#endif

      /* initialize A2DP sink */
      if (esp_a2d_register_callback(ccall_app_a2d_callback) != ESP_OK) {
        ESP_LOGE(BT_AV_TAG, "esp_a2d_register_callback");
      }
      if (esp_a2d_sink_register_data_callback(ccall_audio_data_callback) !=
          ESP_OK) {
        ESP_LOGE(BT_AV_TAG, "esp_a2d_sink_register_data_callback");
      }
      if (esp_a2d_sink_init() != ESP_OK) {
        ESP_LOGE(BT_AV_TAG, "esp_a2d_sink_init");
      }

      // start automatic reconnect if relevant and stack is up
      if (reconnect_status == AutoReconnect && has_last_connection()) {
        ESP_LOGD(BT_AV_TAG, "reconnect");
        memcpy(peer_bd_addr, last_connection, ESP_BD_ADDR_LEN);
        reconnect();
      }

      /* set discoverable and connectable mode, wait to be connected */
      ESP_LOGD(BT_AV_TAG, "set_scan_mode_connectable(true)");
      set_scan_mode_connectable(true);
      break;
    }

    default:
      ESP_LOGE(BT_AV_TAG, "%s unhandled evt %d", __func__, event);
      break;
  }
}

/* callback for A2DP sink */
void BluetoothA2DPSink::app_a2d_callback(esp_a2d_cb_event_t event,
                                         esp_a2d_cb_param_t *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);

  switch (event) {
    case ESP_A2D_CONNECTION_STATE_EVT:
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_CONNECTION_STATE_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_a2d_evt, event, param,
                        sizeof(esp_a2d_cb_param_t));
      break;
    case ESP_A2D_AUDIO_STATE_EVT:
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_AUDIO_STATE_EVT", __func__);
      audio_state = param->audio_stat.state;
      app_work_dispatch(ccall_av_hdl_a2d_evt, event, param,
                        sizeof(esp_a2d_cb_param_t));
      break;
    case ESP_A2D_AUDIO_CFG_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_AUDIO_CFG_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_a2d_evt, event, param,
                        sizeof(esp_a2d_cb_param_t));
      break;
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    case ESP_A2D_PROF_STATE_EVT: {
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_PROF_STATE_EVT", __func__);
      app_work_dispatch(ccall_av_hdl_a2d_evt, event, param,
                        sizeof(esp_a2d_cb_param_t));
      break;
    }
#endif

    default:
      ESP_LOGI(BT_AV_TAG, "Unhandled A2DP event: %d", event);
      break;
  }
}

void BluetoothA2DPSink::audio_data_callback(const uint8_t *data, uint32_t len) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);

  // swap left and right channels
  if (swap_left_right) {
    Frame *frame = (Frame *)data;
    for (int i = 0; i < len / 4; i++) {
      int16_t temp = frame[i].channel1;
      frame[i].channel1 = frame[i].channel2;
      frame[i].channel2 = temp;
    }
  }

  // make data available via callback, before volume control
  if (raw_stream_reader != nullptr) {
    ESP_LOGD(BT_AV_TAG, "raw_stream_reader");
    (*raw_stream_reader)(data, len);
  }

  // adjust the volume
  volume_control()->update_audio_data((Frame *)data, len / 4);

  // make data available via callback
  if (stream_reader != nullptr) {
    ESP_LOGD(BT_AV_TAG, "stream_reader");
    (*stream_reader)(data, len);
  }

  // put data into ringbuffer
  if (is_output) {
    write_audio(data, len);
  }

  // data_received callback
  if (data_received != nullptr) {
    ESP_LOGD(BT_AV_TAG, "data_received");
    (*data_received)();
  }
}


bool BluetoothA2DPSink::is_avrc_connected() { return avrc_connection_state; }

void BluetoothA2DPSink::execute_avrc_command(int cmd) {
  ESP_LOGD(BT_AV_TAG, "execute_avrc_command: %d", cmd);
  esp_err_t ok =
      esp_avrc_ct_send_passthrough_cmd(0, cmd, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (ok == ESP_OK) {
    delay_ms(100);
    ok = esp_avrc_ct_send_passthrough_cmd(0, cmd,
                                          ESP_AVRC_PT_CMD_STATE_RELEASED);
    if (ok == ESP_OK) {
      ESP_LOGD(BT_AV_TAG, "execute_avrc_command: %d -> OK", cmd);
    } else {
      ESP_LOGE(BT_AV_TAG,
               "execute_avrc_command ESP_AVRC_PT_CMD_STATE_RELEASED FAILED: %d",
               ok);
    }
  } else {
    ESP_LOGE(BT_AV_TAG,
             "execute_avrc_command ESP_AVRC_PT_CMD_STATE_PRESSED FAILED: %d",
             ok);
  }
}

void BluetoothA2DPSink::play() { execute_avrc_command(ESP_AVRC_PT_CMD_PLAY); }

void BluetoothA2DPSink::pause() { execute_avrc_command(ESP_AVRC_PT_CMD_PAUSE); }

void BluetoothA2DPSink::stop() { execute_avrc_command(ESP_AVRC_PT_CMD_STOP); }

void BluetoothA2DPSink::next() {
  execute_avrc_command(ESP_AVRC_PT_CMD_FORWARD);
}
void BluetoothA2DPSink::previous() {
  execute_avrc_command(ESP_AVRC_PT_CMD_BACKWARD);
}
void BluetoothA2DPSink::fast_forward() {
  execute_avrc_command(ESP_AVRC_PT_CMD_FAST_FORWARD);
}
void BluetoothA2DPSink::rewind() {
  execute_avrc_command(ESP_AVRC_PT_CMD_REWIND);
}

void BluetoothA2DPSink::volume_up() {
  execute_avrc_command(ESP_AVRC_PT_CMD_VOL_UP);
}

void BluetoothA2DPSink::volume_down() {
  execute_avrc_command(ESP_AVRC_PT_CMD_VOL_DOWN);
}

void BluetoothA2DPSink::set_volume(uint8_t volume) {
  // limit the volume to 127
  s_volume = std::min((int)volume, 0x7f);
  ESP_LOGI(BT_AV_TAG, "set_volume %d -> %d", volume, s_volume);
  volume_control()->set_volume(s_volume);
  volume_control()->set_enabled(true);

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  volume_set_by_local_host(s_volume);
#endif
}

