pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
int BluetoothA2DPSink::get_volume() {
  // ESP_LOGI(BT_AV_TAG, "get_volume %d", s_volume);
  return s_volume;
}

void BluetoothA2DPSink::activate_pin_code(bool active) {
  is_pin_code_active = active;
}

void BluetoothA2DPSink::confirm_pin_code() {
  if (pin_code_int != 0) {
    confirm_pin_code(pin_code_int);
  } else {
    ESP_LOGI(BT_AV_TAG, "pincode not available (yet)");
  }
}

void BluetoothA2DPSink::confirm_pin_code(int code) {
  switch (pin_code_request) {
    case Confirm:
      ESP_LOGI(BT_AV_TAG, "-> %s", to_str(peer_bd_addr));
      if (esp_bt_gap_ssp_confirm_reply(peer_bd_addr, true) != ESP_OK) {
        ESP_LOGE(BT_AV_TAG, "esp_bt_gap_ssp_passkey_reply");
      }
      break;
    case Reply:
      ESP_LOGI(BT_AV_TAG, "confirm_pin_code %d -> %s", code,
               to_str(peer_bd_addr));
      if (esp_bt_gap_ssp_passkey_reply(peer_bd_addr, true, code) != ESP_OK) {
        ESP_LOGE(BT_AV_TAG, "esp_bt_gap_ssp_passkey_reply");
      }
      break;
    default:
      ESP_LOGE(BT_AV_TAG, "No open request -> %s", to_str(peer_bd_addr));
      break;
  }
}


size_t BluetoothA2DPSink::i2s_write_data(const uint8_t *data,
                                         size_t item_size) {
  if (!is_output) return item_size;

  if (!is_i2s_active) {
    ESP_LOGW(BT_AV_TAG, "%s failed - inactive", __func__);
    return 0;
  }

  // split up outout to max size
  int open = item_size;
  int processed = 0;
  while (open > 0) {
    int written =
        out->write(data + processed, std::min(open, A2DP_I2S_MAX_WRITE_SIZE));
    open -= written;
    processed += written;
  }
  return processed;
}

//------------------------------------------------------------
// ==> Methods which are only supported in new ESP Release 4

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

void BluetoothA2DPSink::app_rc_tg_callback(esp_avrc_tg_cb_event_t event,
                                           esp_avrc_tg_cb_param_t *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  switch (event) {
    case ESP_AVRC_TG_CONNECTION_STATE_EVT:
    case ESP_AVRC_TG_REMOTE_FEATURES_EVT:
    case ESP_AVRC_TG_PASSTHROUGH_CMD_EVT:
    case ESP_AVRC_TG_SET_ABSOLUTE_VOLUME_CMD_EVT:
    case ESP_AVRC_TG_REGISTER_NOTIFICATION_EVT:
    case ESP_AVRC_TG_SET_PLAYER_APP_VALUE_EVT: {
      app_work_dispatch(ccall_av_hdl_avrc_tg_evt, event, param,
                        sizeof(esp_avrc_tg_cb_param_t));
      break;
    }
    default:
      ESP_LOGE(BT_AV_TAG, "Unsupported AVRC event: %d", event);
      break;
  }
}

void BluetoothA2DPSink::volume_set_by_controller(uint8_t volume) {
  ESP_LOGI(BT_AV_TAG, "Volume is set by remote controller to %d",
           (uint32_t)volume * 100 / 0x7f);

  _lock_acquire(&s_volume_lock);
  s_volume = volume;
  _lock_release(&s_volume_lock);

  volume_control()->set_volume(s_volume);
  volume_control()->set_enabled(true);

  if (bt_volumechange != nullptr) {
    (*bt_volumechange)(s_volume);
  }
}

void BluetoothA2DPSink::volume_set_by_local_host(uint8_t volume) {
  ESP_LOGI(BT_AV_TAG, "Volume is set locally to: %d%%",
           (uint32_t)volume * 100 / 0x7f);

  _lock_acquire(&s_volume_lock);
  s_volume = volume;
  _lock_release(&s_volume_lock);

  if (s_volume_notify) {
    esp_avrc_rn_param_t rn_param;
    rn_param.volume = s_volume;
    esp_avrc_tg_send_rn_rsp(ESP_AVRC_RN_VOLUME_CHANGE, ESP_AVRC_RN_RSP_CHANGED,
                            &rn_param);
  }
}

void BluetoothA2DPSink::av_hdl_avrc_tg_evt(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_avrc_tg_cb_param_t *rc = (esp_avrc_tg_cb_param_t *)(p_param);

  switch (event) {
    case ESP_AVRC_TG_CONNECTION_STATE_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC conn_state evt: state %d, [%s]",
               rc->conn_stat.connected, to_str(rc->conn_stat.remote_bda));
      break;
    }

    case ESP_AVRC_TG_PASSTHROUGH_CMD_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC passthrough cmd: key_code 0x%x, key_state %d",
               rc->psth_cmd.key_code, rc->psth_cmd.key_state);
      break;
    }

    case ESP_AVRC_TG_SET_ABSOLUTE_VOLUME_CMD_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC remote set absolute volume: %d%%",
               (int)rc->set_abs_vol.volume * 100 / 0x7f);
      volume_set_by_controller(rc->set_abs_vol.volume);
      break;
    }

    case ESP_AVRC_TG_REGISTER_NOTIFICATION_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC register event notification: %d, param: 0x%x",
               rc->reg_ntf.event_id, rc->reg_ntf.event_parameter);
      if (rc->reg_ntf.event_id == ESP_AVRC_RN_VOLUME_CHANGE) {
        s_volume_notify = true;
        esp_avrc_rn_param_t rn_param;
        rn_param.volume = s_volume;
        esp_avrc_tg_send_rn_rsp(ESP_AVRC_RN_VOLUME_CHANGE,
                                ESP_AVRC_RN_RSP_INTERIM, &rn_param);
        // notify user aplication volume change by local is completed
        if (avrc_rn_volchg_complete_callback != nullptr) {
          (*avrc_rn_volchg_complete_callback)(s_volume);
        }
      }
      break;
    }

    case ESP_AVRC_TG_REMOTE_FEATURES_EVT: {
      ESP_LOGI(BT_AV_TAG, "AVRC remote features %x, CT features %x",
               rc->rmt_feats.feat_mask, rc->rmt_feats.ct_feat_flag);
      break;
    }

    default:
      ESP_LOGE(BT_AV_TAG, "%s unhandled evt %d", __func__, event);
      break;
  }
}

#endif
